[
  {
    "path": "labs/L_1/",
    "title": "Week 1 Lab",
    "description": {},
    "author": [
      {
        "name": "Joseph Bulbulia",
        "url": "https://josephbulbulia.netlify.app"
      },
      {
        "name": "Johannes Karl",
        "url": "https://johannes-karl.com"
      }
    ],
    "date": "2021-02-24",
    "categories": [],
    "contents": "\n\nContents\nSkills\nAssemble\nIntroductions\nQuestions\nDefine the following terms related to Rmarkdown, and describe how to do them:\nAnswer the following questions in 1 or 2 sentences:\nRmarkdown Presentation\n\nIntroductions\nAssignment: creating a journal and upload it to Blackboard\nCommit your first Rmarkdown journal\n\n\nSkills\nDo these excercises:\nhttps://commonmark.org/help/tutorial/\nAssemble\nAssemble into groups of 2 - 4 people\nIntroductions\nLearn each others names and interests and prepare a brief introduction for the other(s)\nQuestions\nHow do you set a working directory\nHow do you open and close an Rmarkdown document?\nWhere is the difference between “source” and “console” and when might we use each?\nWhat is “YAML”\nClarify how you found your answers\nDefine the following terms related to Rmarkdown, and describe how to do them:\n“Knit”\n“Show Outline”\n“CMD-S” (command-S)\nClarify how you found the answers.\nAnswer the following questions in 1 or 2 sentences:\nWhy is it important to knit often?\nWhat is “reproducible” research?\nHow might describing your analysis in Rmarkdown improve research?\nWhat are some limitations of Rmarkdown for improving reproducible research?\nRmarkdown Presentation\nCreate a 2-5 slide presentation in Rmarkdown (no images required) on Rstudio GitHub, Ramrkdown\n(You will not be assessed on the content of the slides – so bullet poits are up to you!)\nList advantages and disadvantates of Rmarkdown presentations\nIntroductions\nAssignment: creating a journal and upload it to Blackboard\nCheck that you have Rstudio and GitHub setup. If not, seek help\nCommit your first Rmarkdown journal\nCreate your first Rmarkdown document, and title it “My Journal”\nRecord your impressions of the process of getting set up with RStudio and GitHub\nRecord any help you have offered to other people, and any help you have sought from other people, along the way.\nSave the document and commit it to GitHub.\nNote: set your GitHub repository to private if you wish the account to be private\nFurther instructions under “Labs –> Workbook_1”\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-24T18:56:24+13:00",
    "input_file": "lab_1.utf8.md"
  }
]
