[
  {
    "path": "labs/L_2/",
    "title": "Week 2 Lab",
    "description": {},
    "author": [
      {
        "name": "Joseph Bulbulia",
        "url": "https://josephbulbulia.netlify.app"
      },
      {
        "name": "Johannes Karl",
        "url": "https://johannes-karl.com"
      }
    ],
    "date": "2021-03-03",
    "categories": [],
    "contents": "\n\nContents\nWorkflow\nCreate Repos (if you have not already)\nCreate R projects\nWorkbook 2\n\n\nWorkflow\nIf you haven’t already, set a folder for your R projects. Choose a location on our Hard drive. It is best not to use a shared folder (iCloud, Dropbox, Google Drive) because this can sometime cause problems. GitHub will be your place to store your code.\nMine is called “GIT”.\nUsing the methods you learned last week:\nCreate Repos (if you have not already)\nCreate a repository for 447-journals (if you don’t have one already)\nCreate a repository for your 447-workbooks.\nYou should initialise a Readme statement and a .gitignore document (make sure to click the R .gitignore)\nCreate R projects\nCreate R-projects in each of these repositories.\nIn your workbooks folder, using the + New Folder command, create a folder called data (or similar) This is where you’ll store your data.\nCreate a file called figs (where you’ll stor your figures) 5 Create a folder called workbooks, or similar this is where you’ll store your weekly workbooks.\nWorkbook 2\nOpen an R markdown document, and filling in your name\nThe first code chunk is for your preferences.\n\n\nknitr::opts_chunk$set(echo = TRUE)\n\n\n\nFind the keyboard shortcuts menu.\nMemorise the keyboard shortcut for insert code chunk which is: ⌥⌘I\nUse the mac to insert a code chunk.\nMemorise the shortcut for evaluate which is ⌘-return^ use for all tasks in this workbook.\nUse R to do 10 mathematical calculations\n\n\n4+5\n\n\n[1] 9\n\n\n\n3^3\n\n\n[1] 27\n\nShow your work\nUsing R, find the square root of 324\nIn the iris dataset, find the flower with the longest Sepal.Length. (hint, use the max function.) Show the column details for this flower only.\nIn the iris dataset, find the flower with the shortest Sepal.Length. (hint, use the min function.)\nCalculate the difference bewteen the flower with the longest and shortest Sepal.Length\nMake a 7 column x 100 row dataframe using c, :, dataframe\nRename the columns of the dataframe using the names of snow white dwarfs, or any names.\nUsing the dataset woman, write a linear model for height ~ weight\nCreate a table and coefficient plot for this model\nUsing ggeffects, create a prediction plot for this model.\n\nNext week we’ll be creating plots like this\n\n\nlibrary(ggplot2)\nggplot2::ggplot(data = women) + \n  geom_point(mapping = aes(x = height, y = weight)) + geom_smooth(method = lm, aes(x = height, y = weight)) + theme_classic() \n\n\n\n\nExplain what is being calculated here\n\n\nsum(women$weight > 140) / length(women$weight)\n\n\n[1] 0.4\n\nCalculate the proportion of women who are over the mean weight of women\n\n\n\n\n\n\nWhat are the advantages and disadvantages of creating more breaks in the Petal.Length indicator? Clarify your answer in a paragraph.\n\n\nhist(iris$Petal.Length)\n\n\n\n\n\n\nhist(iris$Petal.Length, breaks = 100)\n\n\n\n\nSpot the error in this code\n\n\n# here is one method. \nmh <- mean(women$height)\nsum(women$weight > mh) / length(women$height)\n\n\n\nReorder the columns of the woman dataset so that weight comes before height. Then rename the columns “w” and “h”.\n\n\n\nRead data into R using the following method:\n\n\n\n\n\n# read data from file\nlibrary(\"readr\")\ntestdata<- readr::read_csv(url(\"https://raw.githubusercontent.com/go-bayes/psych-447/main/data/testdata1.csv\"))\nstr(testdata)\n\n\n\nSave data into your data folder using the following method\n\n\nlibrary(\"here\")\n# save data using here\nsaveRDS(testdata, here::here(\"data\", \"td.RDS\"))\n\n\n\nRead data back into R\n\n\ntd <- readRDS(here::here(\"data\", \"td.RDS\"))\nstr(td)\n\n\n\nUsing the td dataset, write a linear model for height ~ weight as above\n\n\n\nCreate a coefficient plot\nCreate a prediction plot\nExtra credit, how would you interpret the intercept in this model?*\n\n\n\n",
    "preview": "labs/L_2/lab_2_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-03-03T13:35:01+13:00",
    "input_file": "lab_2.utf8.md",
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "labs/L_1/",
    "title": "Week 1 Lab",
    "description": {},
    "author": [
      {
        "name": "Joseph Bulbulia",
        "url": "https://josephbulbulia.netlify.app"
      },
      {
        "name": "Johannes Karl",
        "url": "https://johannes-karl.com"
      }
    ],
    "date": "2021-02-24",
    "categories": [],
    "contents": "\n\nContents\nSkills\nAssemble\nIntroductions\nQuestions\nDefine the following terms related to Rmarkdown, and describe how to do them:\nAnswer the following questions in 1 or 2 sentences:\nRmarkdown Presentation\n\nIntroductions\nAssignment: creating a journal and upload it to Blackboard\nCommit your first Rmarkdown journal\n\n\nSkills\nDo these excercises:\nhttps://commonmark.org/help/tutorial/\nAssemble\nAssemble into groups of 2 - 4 people\nIntroductions\nLearn each others names and interests and prepare a brief introduction for the other(s)\nQuestions\nHow do you set a working directory\nHow do you open and close an Rmarkdown document?\nWhere is the difference between “source” and “console” and when might we use each?\nWhat is “YAML”\nClarify how you found your answers\nDefine the following terms related to Rmarkdown, and describe how to do them:\n“Knit”\n“Show Outline”\n“CMD-S” (command-S)\nClarify how you found the answers.\nAnswer the following questions in 1 or 2 sentences:\nWhy is it important to knit often?\nWhat is “reproducible” research?\nHow might describing your analysis in Rmarkdown improve research?\nWhat are some limitations of Rmarkdown for improving reproducible research?\nRmarkdown Presentation\nCreate a 2-5 slide presentation in Rmarkdown (no images required) on Rstudio GitHub, Ramrkdown\n(You will not be assessed on the content of the slides – so bullet poits are up to you!)\nList advantages and disadvantates of Rmarkdown presentations\nIntroductions\nAssignment: creating a journal and upload it to Blackboard\nCheck that you have Rstudio and GitHub setup. If not, seek help\nCommit your first Rmarkdown journal\nCreate your first Rmarkdown document, and title it “My Journal”\nRecord your impressions of the process of getting set up with RStudio and GitHub\nRecord any help you have offered to other people, and any help you have sought from other people, along the way.\nSave the document and commit it to GitHub.\nNote: set your GitHub repository to private if you wish the account to be private\nFurther instructions under “Labs –> Workbook_1”\n\n\n\n",
    "preview": {},
    "last_modified": "2021-02-24T18:56:24+13:00",
    "input_file": {}
  }
]
